Catalogs/НоменклатураПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НоменклатураПоставщиков</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаШтрихКода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_МаскиШтрихКодовOS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатураПоставщиков/Ext/ManagerModule.bsl
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Отбор.Номенклатура;
		Параметры.Отбор.Удалить("Номенклатура");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Характеристика") Тогда
		Характеристика = Параметры.Отбор.Характеристика;
		Параметры.Отбор.Удалить("Характеристика");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Упаковка") Тогда
		Упаковка = Параметры.Отбор.Упаковка;
		Параметры.Отбор.Удалить("Упаковка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс


Процедура СоздатьНоменклатуруПоставщика(Контрагент,Номенклатура,Артикул,Наименование="")Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПоставщиков.Ссылка КАК Ссылка,
		|	НоменклатураПоставщиков.Артикул КАК Артикул
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НоменклатураПоставщиков.ЭтоГруппа = ЛОЖЬ
		|	И НоменклатураПоставщиков.Номенклатура = &Номенклатура
		|	И НоменклатураПоставщиков.Владелец = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		НоменклатураОбъект = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		НоменклатураОбъект.Владелец 	= Контрагент;
		НоменклатураОбъект.Номенклатура = Номенклатура;	
		НоменклатураОбъект.Артикул		= Артикул;
		Если ЗначениеЗаполнено(Наименование) Тогда 
			НоменклатураОбъект.Наименование = Наименование;
		КонецЕсли;
		НоменклатураОбъект.Записать();	
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.Артикул <> Артикул Тогда
			
			НоменклатураОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			НоменклатураОбъект.Артикул = Артикул;
			НоменклатураОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
